package com.company.tasks;
/*
Вывести на одной строке числа 47, 52 и 150 с двумя пробелами между ними. Текст '47 52 150' не использовать
 */
public class Task_1_02 {
    public static void main (String[] args) {
        int a = 47, b = 52, c = 150;
        String space = "  ";
        System.out.println(a + space + b + space + c);
    }
}
